
**Initializing the backend...**

```diff
+Successfully configured the backend "s3"! Terraform will automatically
+use this backend unless the backend configuration changes.
```

**Initializing provider plugins...**
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (terraform-providers/aws) 2.26.0...

```diff
+Terraform has been successfully initialized!
```
**Refreshing Terraform state in-memory prior to plan...**
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

**aws_sns_topic.rebuild_root_topic: Refreshing state... [id=arn:aws:sns:us-east-1:385198630581:s3pypi-rebuild-root]**
**aws_iam_role.gen_index_role: Refreshing state... [id=s3pypi-gen-index]**
**aws_s3_bucket.index_bucket: Refreshing state... [id=s3pypi-index]**
**aws_iam_role.gen_proj_index_role: Refreshing state... [id=s3pypi-gen-proj-index]**
**aws_s3_bucket.artifact_bucket: Refreshing state... [id=s3pypi-artifacts]**
**aws_iam_role_policy_attachment.gen_proj_index_basic_lambda: Refreshing state... [id=s3pypi-gen-proj-index-20190831224431601700000002]**
**aws_iam_role_policy_attachment.gen_index_basic_lambda: Refreshing state... [id=s3pypi-gen-index-20190831224431225500000001]**
**aws_sns_topic.update_topic: Refreshing state... [id=arn:aws:sns:us-east-1:385198630581:s3pypi-updates]**
**aws_iam_policy.generate_proj_index: Refreshing state... [id=arn:aws:iam::385198630581:policy/s3pypi-generate-proj-index]**
**aws_iam_policy.generate_base_index: Refreshing state... [id=arn:aws:iam::385198630581:policy/s3pypi-generate-base-index]**
**aws_lambda_function.gen_proj_index_lambda: Refreshing state... [id=s3pypi-gen-proj-index]**
**aws_lambda_function.gen_index_lambda: Refreshing state... [id=s3pypi-gen-index]**
**aws_s3_bucket_notification.artifact_notification: Refreshing state... [id=s3pypi-artifacts]**
**aws_iam_role_policy_attachment.gen_index_s3_access: Refreshing state... [id=s3pypi-gen-index-20190831224431617700000003]**
**aws_lambda_permission.gen_index_from_sns: Refreshing state... [id=terraform-20190831224440607800000004]**
**aws_sns_topic_subscription.gen_index_sub: Refreshing state... [id=arn:aws:sns:us-east-1:385198630581:s3pypi-rebuild-root:d44b729b-7265-446a-90c7-2e43739533a4]**
**aws_lambda_permission.gen_proj_index_from_sns: Refreshing state... [id=terraform-20190831224440805200000005]**
**aws_sns_topic_subscription.gen_proj_index_sub: Refreshing state... [id=arn:aws:sns:us-east-1:385198630581:s3pypi-updates:d8dc4b4e-e152-441b-be9a-bce9e01de217]**
**aws_iam_role_policy_attachment.gen_proj_index_s3_access: Refreshing state... [id=s3pypi-gen-proj-index-20190831225009960800000001]**

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
```diff
+    create
```

Terraform will perform the following actions:

  **# aws_cloudfront_distribution.index_distrib** will be created
```diff
+    resource "aws_cloudfront_distribution" "index_distrib" {
+        active_trusted_signers         = (known after apply)
+        arn                            = (known after apply)
+        caller_reference               = (known after apply)
+        domain_name                    = (known after apply)
+        enabled                        = true
+        etag                           = (known after apply)
+        hosted_zone_id                 = (known after apply)
+        http_version                   = "http2"
+        id                             = (known after apply)
+        in_progress_validation_batches = (known after apply)
+        is_ipv6_enabled                = true
+        last_modified_time             = (known after apply)
+        price_class                    = "PriceClass_All"
+        retain_on_delete               = false
+        status                         = (known after apply)
+        wait_for_deployment            = true
```

```diff
+        default_cache_behavior {
+            allowed_methods        = [
+                "GET",
+                "HEAD",
+                "OPTIONS",
```
            ]
```diff
+            cached_methods         = [
+                "GET",
+                "HEAD",
```
            ]
```diff
+            compress               = true
+            default_ttl            = 300
+            max_ttl                = 31536000
+            min_ttl                = 0
+            target_origin_id       = "s3pypi-origin"
+            viewer_protocol_policy = "redirect-to-https"
```

```diff
+            forwarded_values {
+                query_string = false
```

```diff
+                cookies {
+                    forward = "none"
```
                }
            }
        }

```diff
+        origin {
+            domain_name = "s3pypi-index.s3-website-us-east-1.amazonaws.com"
+            origin_id   = "s3pypi-origin"
```
        }

```diff
+        restrictions {
+            geo_restriction {
+                restriction_type = "none"
```
            }
        }

```diff
+        viewer_certificate {
+            cloudfront_default_certificate = true
+            minimum_protocol_version       = "TLSv1"
```
        }
    }

**Plan:** 1 to add, 0 to change, 0 to destroy.
